// Menu
"About Hackintool" = "Hackintool에 관하여";
"Check for Updates..." = "업데이트 확인...";
"Preferences…" = "환경 설정…";
"Services" = "서비스";
"Hide Hackintool" = "Hackintool 가리기";
"Hide Others" = "기타 가리기";
"Quit Hackintool" = "Hackintool 종료";
"File" = "파일";
"Open…" = "열기";
"Open Recent" = "최근 사용 열기";
"Generate Audio Codecs Info" = "오디오 코덱 정보 생성";
"Import" = "불러오기";
"IOReg Dump (Native)" = "IOReg 덤프 (기존 내용)";
"IOReg Dump (Patched)" = "IOReg 덤프 (패치 내용)";
"Bootloader config.plist" = "부트로더 Config.plist";
"Framebuffer Text" = "텍스트화 프레임 버퍼";
"Framebuffer Binary" = "바이너리화 프레임 버퍼";
"Edit" = "편집";
"Cut" = "오려두기";
"Copy" = "복사하기";
"Paste" = "붙여넣기";
"Paste and Match Style" = "붙여넣고 스타일 매치시킴";
"Select All" = "모두 선택";
"Find" = "찾기";
"Find…" = "찾기…";
"Find and Replace…" = "찾기 및 대치…";
"Find Next" = "다음 찾기";
"Find Previous" = "이전 찾기";
"Use Selection for Find" = "선택 부분으로 찾기";
"Jump to Selection" = "선택 부분으로 이동";
"Spelling and Grammar" = "맞춤법 및 문법";
"Check Document Now" = "지금 문서 검사";
"Check Spelling While Typing" = "입력하는 동안 맞춤법 검사";
"Check Grammar With Spelling" = "맞춤법 및 문법 검사";
"Correct Spelling Automatically" = "맞춤법 자동 ​​수정";
"Substitutions" = "대체";
"Show Substitutions" = "대체 보기";
"Smart Copy/Paste" = "스마트 복사하기/붙여넣기";
"Smart Quotes" = "스마트 인용";
"Smart Dashes" = "스마트 대시";
"Smart Links" = "스마트 링크";
"Data Detectors" = "데이터 탐색기";
"Text Replacement" = "텍스트 대치";
"Transformations" = "변형";
"Make Upper Case" = "대문자로 만들기";
"Make Lower Case" = "소문자로 만들기";
"Capitalize" = "대문자로 시작";
"Speech" = "말하기";
"Start Speaking" = "말하기 시작";
"Stop Speaking" = "말하기 중단";
"View" = "보기";
"Show Toolbar" = "도구 막대 보기";
"Hide Toolbar" = "도구 막대 가리기";
"Customize Toolbar…" = "도구 막대 사용자화…";
"Import KextsToPatch" = "KextsToPatch 불러오기";
"Find:" = "찾기:";
"Replace:" = "대치:";
"Cancel" = "취소";
"OK" = "확인";
"Window" = "윈도우";
"Help" = "도움말";
"System Configs" = "시스템 구성";
"Apply Current Patches" = "현재 패치 적용";
"Minimize" = "최소화";
"Zoom" = "확대/축소";
"Bring All to Front" = "모두 앞으로 가져오기";
"Hackintool Help" = "Hackintool 도움말";

// Tabs
"Patch" = "패치";
"Boot" = "부트";
"NVRAM" = "NVRAM";
"Extensions" = "커널 모듈";
"Displays" = "디스플레이";
"Sound" = "사운드";
"USB" = "USB";
"Disks" = "디스크";
"PCIe" = "PCIe";
"Power" = "전원";
"Calc" = "계산기";
"Utilities" = "유틸리티";
"Logs" = "로그";

// Info / System
"Unlock" = "잠금 해제";
"System" = "시스템";
"Serial" = "일련번호";
"Model" = "모델";
"Peripherals" = "주변장치";
"Name" = "이름";
"Value" = "값";
"System Info" = "시스템 정보";
"Host" = "호스트 이름";
"OS" = "운영체제";
"Kernel" = "커널";
"RAM" = "램 용량";
"Model Identifier" = "모델 식별자";
"Intel Generation" = "CPU 세대";
"Platform ID" = "플랫폼 ID";
"Board ID" = "보드 ID";
"FW Version" = "펌웨어 버전";
"Serial Number" = "일련번호";
"Hardware UUID" = "하드웨어 UUID";
"System ID" = "시스템 UUID";
"Board Serial Number" = "보드 일련번호";
"VDA Decoder" = "VDA 디코더";
"Fully Supported" = "지원됨";
"Not Supported" = "지원되지 않음";
"Decoder Failed" = "디코더 가속 실패";
"Serial Info" = "시리얼 정보";
"Country" = "생산국가";
"Year" = "생산연도";
"Week" = "생산주차";
"Line" = "생산라인";
"Valid" = "유효 여부";
"Possibly" = "유효";
"Unlikely" = "무효";
"GPU Name" = "GPU 이름";
"GPU Device ID" = "GPU 기기 ID";
"Total VRAM" = "전체 VRAM";
"Free VRAM" = "남은 VRAM";
"Quartz Extreme (QE/CI)" = "쿼츠 익스트림 (QE/CI)";
"Metal Supported" = "Metal 지원";
"Metal Device Name" = "Metal 장치 이름";
"Metal Default Device" = "Metal 기본장치";
"Metal Low Power" = "Metal 저전력";
"Metal Headless" = "Metal 헤드리스";
"iMessage Keys" = "iMessage 키";
"Check Serial (EveryMac.com)" = "시리얼 검증 (EveryMac)";
"Check Serial (Apple.com)" = "시리얼 검증 (Apple)";
"Export" = "내보내기";
"Model:" = "모델:";

// Info / Model
"2nd Disp Support" = "외장 디스플레이 지원";
"2nd Max Res" = "외장 디스플레이 최대 해상도";
"Apple Subfamily" = "애플 세부 모델명";
"Architecture" = "아키텍처";
"Avg Weight" = "평균 무게";
"Battery Life" = "배터리 사용 시간";
"Battery Type" = "배터리 타입";
"Cache Bus Speed" = "캐시 버스 속도";
"Case Type" = "외장 유형";
"Custom Speeds" = "구성 가능 속도";
"Dimensions" = "크기";
"Discontinued Date" = "단종 날짜";
"Display" = "디스플레이";
"EFI Architecture" = "EFI 아키텍쳐";
"EMC Number" = "EMC 번호";
"Est Current Retail" = "현재 소매 가격";
"Expansion Bays" = "확장 베이";
"Expansion Slots" = "확장 슬롯";
"Firewire" = "파이어와이어";
"Firewire Support" = "파이어와이어 지원";
"Geekbench 2 32" = "긱벤치 2 32b";
"Geekbench 2 64" = "긱벤치 2 64b";
"Geekbench 3 MC 32" = "긱벤치 3 멀티 32b";
"Geekbench 3 MC 64" = "긱벤치 3 멀티 64b";
"Geekbench 3 SC 32" = "긱벤치 3 싱글 32b";
"Geekbench 3 SC 64" = "긱벤치 3 싱글 64b";
"Geekbench 4 MC" = "긱벤치 4 멀티";
"Geekbench 4 SC" = "긱벤치 4 싱글";
"Input Type" = "입력 장치 타입";
"Int HD Interface" = "내장 디스크 인터페이스";
"Introduction Date" = "제품 발표 날짜";
"Keyboard Type" = "키보드 타입";
"L1 Cache" = "L1 캐시";
"L2 Cache" = "L2 캐시";
"Mac OS 9 Support" = "Mac OS 9 지원";
"Maximum OS" = "지원하는 최고 OS";
"Maximum RAM" = "최대 RAM 용량";
"Maximum VRAM" = "최대 VRAM 용량";
"Maximum Windows" = "지원하는 최고 Windows";
"Min. RAM Speed" = "기본 RAM 속도";
"Minimum Windows" = "지원하는 최저 Windows";
"Model Number" = "모델 번호";
"Motherboard RAM" = "온보드 램";
"Order Number" = "부품 번호";
"Original OS" = "번들 OS";
"Original Price" = "출시 가격";
"Processor Speed" = "CPU 속도";
"Processor Type" = "CPU 타입";
"Processor Upgrade" = "CPU 소켓";
"Processors (Cores)" = "CPU 수 (코어 수)";
"RAM Slots" = "램 슬롯";
"RAM Type" = "램 타입";
"Resolution" = "해상도";
"ROM/Firmware" = "롬/펌웨어";
"Standard AirPort" = "AirPort 프로토콜";
"Standard Bluetooth" = "블루투스 프로토콜";
"Standard Ethernet" = "이더넷 프로토콜";
"Standard HD" = "기본 저장 장치";
"Standard Optical" = "기본 광학 드라이브";
"Standard RAM" = "기본 RAM";
"Standard VRAM" = "기본 VRAM";
"System Bus Speed" = "시스템 버스";
"Turbo Boost" = "터보 부스트";
"VRAM Type" = "VRAM 타입";
"Video Card" = "비디오 카드";
"Video Port" = "비디오 포트";
"Windows Support" = "윈도우 지원";
"Visit" = "EveryMac에서 보기";

// Info / Misc
"Vendor" = "벤더";
"Device" = "기기";
"Vendor Name" = "벤더 이름";
"Device Name" = "기기 이름";
"Builtin" = "내장";
"FW Loaded" = "펌웨어 로드됨";
"Framebuffer" = "프레임버퍼";
"Ports" = "포트";
"Sub Device" = "하위 기기";
"Codec" = "코덱";
"Revision" = "개정판";
"Type" = "타입";
"Location" = "위치";
"Phy Block" = "물리 섹터";

// Patch
"Intel Generation:" = "CPU 세대:";
"Platform ID:" = "플랫폼 ID:";
"Go To Current" = "현재 시스템 정보로 설정";
"Reload" = "새로고침";
"Info" = "정보";
"VRAM" = "VRAM";
"Connectors" = "커넥터";

// Patch / Current Framebuffer Info
"Current Framebuffer" = "현재 프레임버퍼 정보";
"GPU Device ID(s)" = "GPU 기기 ID";
// Patch / Selected Framebuffer Info
"Selected Framebuffer" = "선택된 프레임버퍼 정보";
"Mobile" = "모바일";
"Intel Platform ID(s)" = "인텔 플랫폼 ID";
"Model(s)" = "모델 식별자";

// Patch / VRAM Info
"Stolen" = "Stolen 메모리";
"FBMem" = "FB 메모리";
"Max Stolen" = "최대 Stolen 메모리";
"Total Stolen" = "총 Stolen 메모리";
"Total Cursor" = "총 Cursor 메모리";
"Max Overall" = "총합";

// Patch / Framebuffer
"FramebufferID" = "프레임버퍼 ID";
"PipeCount" = "파이프 수";
"PortCount" = "포트 수";
"FBMemoryCount" = "FB 메모리 수";
"StolenMemorySize" = "Stolen 메모리 용량";
"FramebufferMemorySize" = "FB 메모리 용량";
"CursorMemorySize" = "Cursor 메모리 용량";
"UnifiedMemorySize" = "Unified 메모리 용량";
"Flags" = "플래그";
"Disabled" = "비활성화";
"Unsupported" = "지원되지 않음";

// Patch / Connectors
"Index" = "인덱스";
"Bus ID" = "버스 ID";
"Pipe" = "파이프";

// Patch / Patch
"General" = "기본";
"Advanced" = "고급";
"iASL DSL Source" = "iASL DSL 소스";
"Graphic Device" = "그래픽 장치";
"Audio Device" = "오디오 장치";
"PCI Devices" = "PCI 장치";
"All" = "전체";
"Auto Detect Changes" = "변경사항 자동 감지";
"Use AllData Method" = "AllData 방법 사용";
"DVMT pre-alloc 32 MB" = "DVMT 32MB 사전할당";
"Disable eGPU" = "외장GPU 비활성화";
"DP -> HDMI" = "DP를 HDMI로 변경";
"Use Intel HDMI" = "인텔 HDMI 사용";
"Hotplug Reboot Fix" = "탈부착 시 ​​재부팅 해결";
"HDMI Infinite Loop Fix" = "HDMI 무한루프 해결";
"Spoof Audio Device ID" = "오디오 기기 ID 교체";
"Spoof Video Device ID:" = "비디오 기기 ID 교체:";
"VRAM 2048 MB" = "2048MB 비디오램 설정";
"Enable HDMI20 (4K)" = "HDMI20 (4K) 활성화";
"GfxYTile Fix" = "GfxYTile 수정";
"USB Port Limit" = "USB 포트 제한";
"Framebuffer Port Limit:" = "프레임버퍼 포트 수 제한:";
"Inject Fake IGPU" = "가짜 IGPU 장치 주입";
"Enable Driver" = "드라이버 활성화";
"Connector Index:" = "커넥터 인덱스:";
"Preferred Mode:" = "사용자 선호 모드:";
"LS (DP to HDMI 1.4)" = "LS (DP를 HDMI 1.4로 변환)";
"PCON (DP to HDMI 2.0)" = "PCON (DP를 HDMI 2.0으로 변환)";
"Generate Patch" = "패치 생성";

// Patch Options / Advanced ToolTips
"TT_DVMTPreAlloc32MB" = "BIOS 설정을 위해 DVMT 사전할당을 32MB로 설정 (stolenmem=19MB / fbmem=9MB)";
"TT_VRAM2048MB" = "몇몇 4K 화면의 글리치 현상을 해결하기 위해 VRAM을 2048MB로 설정 (unifiedmem=2048MB)";
"TT_DisableeGPU" = "외장GPU 비활성화 (disable-external-gpu)";
"TT_EnableHDMI20" = "HDMI 사용시 UHD에서 60fps 활성화 (enable-hdmi20)";
"TT_DPtoHDMI" = "커넥터 타임 DP를 HDMI로 교체";
"TT_GfxYTileFix" = "macOS 10.12부터 발생하는 HD 530 (Skylake) 그래픽의 메뉴바 글리치 현상을 고칩니다. (AAPL,GfxYTile)";
"TT_UseIntelHDMI" = "활성화 시 GFX0와 HDEF 장치에 hda-gfx=onboard-1, ATI나 Nvidia HDMI 장치에 onboard-2가 부여됩니다. 비활성화 시 ATI나 Nvidia 장치가 HDAU 장치와 같이 onboard-1이 됩니다.";
"TT_USBPortLimit" = "USB 포트 제한 패치 주입";
"TT_HotplugRebootFix" = "커넥터 파이프 값을 18로 설정";
"TT_DPCDMaxLinkRate" = "XPS 15 9570 등의 invalid maximum link rate 문제 해결";
"TT_HDMIInfiniteLoopFix" = "그래픽 드라이버가 더 높은 pixel clock rate의 HDMI 연결을 시도할 때 생기는 무한루프 (시스템 멈춤과 블랙스크린 현상) 를 고칩니다. \r\r- HDMI 1.4 포트로 \"제한된\" 2K/4K (2K@59Hz 또는 4K@30Hz) 출력을 원한다면 이 패치가 도움이 될 것입니다.\r- IGPU에 직결된 HDMI 2.0 포트가 해당 문제를 겪는다면, HDMI 포트의 인덱스 값을 알아내고 완전한 HDMI 2.0 출력이 가능한 LSPCON 드라이버 지원을 활성화하기 위해 이 패치를 임시로 사용할 수 있습니다.";
"TT_FramebufferPortLimit" = "포트 수 제한을 위해 커넥터 인덱스 값을 -1 (비활성화)로 설정";
"TT_SpoofAudioDeviceID" = "HDEF device-id 교체";
"TT_SpoofVideoDeviceID" = "IGPU device-id 교체";
"TT_InjectDeviceID" = "IGPU device-id 교체";
"TT_InjectFakeIGPU" = "가짜 IGPU 장치 주입";
// Patch Options / LSPCON ToolTips
"TT_LSPCONEnableDriver" = "근래의 노트북은 HDMI 2.0 포트가 있습니다. (이 포트는 IGPU나 DGPU에 직결되며, Windows 10에서 확인 가능합니다.) 하지만 내장 (U)HD Graphics는 원래 HDMI 2.0 출력을 제공하지 않기 때문에 제조사들은 보드에 LSPCON이라는 DP를 HDMI 2.0으로 바꾸는 장치를 추가했습니다.\r\rLSPCON은 Level Shifter (LS)나 Protocol Converter (PCON) 모드로 작동합니다. 어댑터가 LS 모드로 작동할 때는 HDMI 1.4, PCON 모드일 때는 HDMI 2.0 신호를 만들 수 있습니다. XPS 15 9570 등 몇몇 온보드 LSPCON 어댑터는 펌웨어단에서 LS 모드로 작동하도록 되어 있기 때문에 HDMI 2.0 연결을 할 때 블랙스크린 현상이 발생합니다.\r\rWhateverGreen 1.3.0부터 온보드 LSPCON을 위한 드라이버 지원을 제공하며, HDMI 연결 시 자동으로 어댑터를 PCON 모드로 구성함으로써 몇몇 플랫폼에서의 블랙스크린 현상을 해결합니다.\r\r- LSPCON 드라이버는 IGPU에 직결된 HDMI 2.0을 가진 PC에서만 작동합니다.\r- LSPCON 드라이버는 IGPU가 순수한 HDMI 2.0 출력을 제공하지 않는 이상 필수입니다.\r- 지원되는 인텔 플랫폼: Skylake 이상.\rSkylake 예시: Intel NUC Skull Canyon; Iris Pro 580 + Parade PS175 LSPCON을 통한 HDMI 2.0 지원.\rCoffee Lake 예시: XPS 15 9570 등의 Parade PS175 LSPCON을 통한 HDMI 2.0 지원.\r- 만약 IGPU에 직결된 HDMI 2.0이 잘 작동한다면 온보드 LSPCON이 이미 PCON 모드로 작동하는 것이므로 이 드라이버가 필요 없습니다.";

// Framebuffer Flags ToolTips
"TT_FBAvoidFastLinkTraining" = "Discovered in AppleIntelFBController::LinkTraining. Disables the use of FastLinkTraining.\rAccording to joevt with zero SKL link training happens at 450 MHz else at 540 MHz";
"TT_FBFramebufferCommonMemory" = "Sets the logic of minStolenMem calculation, when set fStolenMemorySize is not multiplied\rby fFBMemoryCount, assuming fStolenMemorySize counts all framebuffers at once.";
"TT_FBFramebufferCompression" = "Discovered in AppleIntelFramebufferController::getFeatureControl.\rThis is equivalent to setting FBC=1 in the plist FeatureControl section.";
"TT_FBEnableSliceFeatures" = "Discovered in AppleIntelFramebufferController::getFeatureControl.\rThis is equivalent to setting SliceSDEnable=1, EUSDEnable=1, DynamicSliceSwitch=1 in the plist FeatureControl section.";
"TT_FBDynamicFBCEnable" = "Discovered in AppleIntelFramebufferController::getFeatureControl.\rThis is equivalent to setting DynamicFBCEnable=1 in the plist FeatureControl section.";
"TT_FBUseVideoTurbo" = "This sets fUseVideoTurbo=1 and loads GPU turbo frequency from the specific field.\rDefaults to 14, can be overridden by VideoTurboFreq in the plist FeatureControl section.";
"TT_FBForcePowerAlwaysConnected" = "Discovered in AppleIntelFramebuffer::getDisplayStatus.\rEnforces display power reset even on always connected displays (see connector flags CNConnectorAlwaysConnected).";
"TT_FBDisableHighBitrateMode2" = "According to joevt this enforces High Bitrate mode 1, which limits DP bitrate to 8.64 Gbit/s instead of normal 17.28 Gbit/s (HBR2).\rI do not think this is used on Skylake any longer.";
"TT_FBBoostPixelFrequencyLimit" = "This bit is not used on Broadwell and newer but set when fPortCount > 0, i.e. for all online framebuffers.\rOn Haswell it is used by AppleIntelFramebuffer::GetOnlineInfo and is set only on 0x0D260007 (MacBookPro11,3) and 0x0D26000E, which are top models.\rThis appears to boost pixel frequency limit (aka pixel clock) to 540000000 Hz (from the usual 216000000, 320000000, 360000000, 450000000).";
"TT_FBLimit4KSourceSize" = "Discovered in AppleIntelFramebuffer::ValidateSourceSize.\rLimits source size to 4096x4096.";
"TT_FBAlternatePWMIncrement1" = "Discovered in AppleIntelFramebufferController::start.\rThese bits appear to be entirely equivalent and could be used interchangeably. Result in setting:\r- PCH_LP_PARTITION_LEVEL_DISABLE (1 << 12) bit in SOUTH_DSPCLK_GATE_D (0xc2020)\r- LPT_PWM_GRANULARITY (1 << 5) bit in SOUTH_CHICKEN2 (0xc2004)\rSee Linux driver sources (lpt_init_clock_gating, lpt_enable_backlight).\rSince these bits are setting backlight pulse width modularity, there is no sense in setting them without a built-in display (i.e. on desktop).";
"TT_FBAlternatePWMIncrement2" = "Discovered in AppleIntelFramebufferController::start.\rThese bits appear to be entirely equivalent and could be used interchangeably. Result in setting:\r- PCH_LP_PARTITION_LEVEL_DISABLE (1 << 12) bit in SOUTH_DSPCLK_GATE_D (0xc2020)\r- LPT_PWM_GRANULARITY (1 << 5) bit in SOUTH_CHICKEN2 (0xc2004)\rSee Linux driver sources (lpt_init_clock_gating, lpt_enable_backlight).\rSince these bits are setting backlight pulse width modularity, there is no sense in setting them without a built-in display (i.e. on desktop).";
"TT_FBDisableFeatureIPS" = "Discovered in Broadwell AppleIntelFBController::start / AppleIntelFBController::getFeatureControl.\rThis is equivalent to setting DisableFeatureIPS=1 in the plist FeatureControl section.\rIPS stands for Intermediate Pixel Storage";
"TT_FBUnknownFlag_2000" = "";
"TT_FBAllowConnectorRecover" = "Discovered in Broadwell AppleIntelFBController::getOSInformation.\rUsed by AppleIntelFramebufferController::LinkTraining for camellia version 2.\rCan be overridden by -notconrecover boot-arg, which effectively unsets this bit.";
"TT_FBUnknownFlag_8000" = "";
"TT_FBUnknownFlag_10000" = "";
"TT_FBUnknownFlag_20000" = "";
"TT_FBDisableGFMPPFM" = "Discovered in AppleIntelFramebufferController::getFeatureControl.\rThis takes its effect only if GFMPPFM in the plist FeatureControl section is set to 2, otherwise GFMPPFM is off.";
"TT_FBUnknownFlag_80000" = "";
"TT_FBUnknownFlag_100000" = "";
"TT_FBEnableDynamicCDCLK" = "Discovered in AppleIntelFramebufferController::getFeatureControl.\rThis takes its effect only if SupportDynamicCDClk in the plist FeatureControl section is set to 1, otherwise off.\rAlso requires dc6config to be set to 3 (default).";
"TT_FBUnknownFlag_400000" = "";
"TT_FBSupport5KSourceSize" = "Discovered in AppleIntelFramebuffer::enableController.\rUsed by AppleIntelFramebuffer::ValidateSourceSize.\rSetting this bit increases the maximum source size from 4096x4096 to 5120x5120.\rMost likely this enables 5K support via Intel HD.";
"TT_FBUnknownZeroFlags" = "";

// Connector Info ToolTips
"TT_Index" = "조심하세요, 이건 정말 복잡합니다 (AppleIntelFramebufferController::MapFBToPort 참고).\r왜 이게 있는건지 완전히 확신할 수는 없고, 0부터 시작하는 순차적인 배열로 설정하는 것을 권장합니다.\r\r허용되는 값은 0, 1, 2, 3 그리고 -1 (0xFF)입니다. 인덱스가 이런 순차적 배열과 같을 때 원리는 간단합니다:\r인덱스 0을 가진 포트는 다른 값에 상관없이 내장 (LVDS 타입) 으로 간주됩니다.\r인덱스 1~3을 가진 포트는 타입과 대조되며, HDMI라면 디지털 오디오를 허용할 것이고, 그 외에는 DP로 가정됩니다.\r인덱스 0xFF을 가진 포트는 무시됩니다.\r\r인덱스가 순차적 배열이 아니라면 포트 타입은 connector[index].type에서 가져올 것입니다.\r이를테면, 2개의 포트가 있을 경우:\r0 - [1]     busID 4 타입 LVDS\r1 - [2]     busID 5 타입 DP\r2 - [3]     busID 6 타입 HDMI\r3 - [-1]    busID 0 타입 Dummy\r이것은 타입이 교체된 2개의 프레임버퍼를 가집니다:\r0 - busID 4 타입 DP\r1 - busID 5 타입 HDMI\r사실 busID 값 또한 connector[index].busID에서 가져오나 나중에 정의된 인덱스를 가진 커넥터를 검색함으로써 \rAppleIntelFramebufferController::getGMBusIDfromPort를 통해 도로 매핑됩니다.\r이 검색은 특별히 마킹된 커넥터 (-1)를 찾자마자 멈출 것입니다. 설명하자면, 2개의 포트를 가질 경우:\r0 - [1]     busID 4 타입 LVDS\r1 - [2]     busID 5 타입 DP\r2 - [-1]    busID 6 타입 HDMI\r3 - [-1]    busID 0 타입 Dummy\r이것은 타입과 두번째 busID가 교체된 2개의 프레임버퍼를 만듭니다:\r0 - busID 4 타입 DP\r1 - busID 6 타입 HDMI\r그것은 또한 port-number 계산에 사용됩니다.\r- LVDS 디스플레이 (엄밀히 말하면, CNConnectorAlwaysConnected 플래그를 가진 디스플레이) 는 port-number 0을 얻습니다.\r- 다른 디스플레이는 인덱스 - port-number 매핑을 겪습니다: 1 - 5, 2 - 6, 3 - 7, 또는 0.";
"TT_BusID" = "AppleIntelFramebufferController::getGMBusIDfromPort를 불러옴으로써 AppleIntelFramebufferController::MapFBToPort에 의해 입증됩니다.\r이는 GMBUS (Graphic Management Bus) ID입니다. (https://01.org/sites/default/files/documentation/intel-gfx-prm-osrc-hsw-display_0.pdf)\r사용법은 하기 URL에서 찾을 수 있습니다.\rIntel Linux Graphics Driver source code:\rhttps://github.com/torvalds/linux/blob/6481d5ed076e69db83ca75e751ad492a6fb669a7/drivers/gpu/drm/i915/intel_i2c.c#L43\rhttps://github.com/torvalds/linux/blob/605dc7761d2701f73c17183649de0e3044609817/drivers/gpu/drm/i915/i915_reg.h#L3053\r하지만 Linux에서 0은 비활성화를 뜻하는데 Apple에서는 좀 특별한 의미를 지니며 내장 디스플레이에 사용됩니다.\r그 외 값들은 같습니다:\r- GMBUS_PIN_DPC    (4)  HDMIC\r- GMBUS_PIN_DPB    (5)  SDVO, HDMIB\r- GMBUS_PIN_DPD    (6)  HDMID\r- GMBUS_PIN_VGADDC (2)  VGA (Broadwell까지).\r따라서 HDMI나 DP 디스플레이에는 기본적으로 4, 5, 6을 사용할 수 있습니다.\r값 5는 SDVO를 지원하기 때문에 (https://en.wikipedia.org/wiki/Serial_Digital_Video_Out), DVI 디스플레이 지원을 위해서도 사용할 수 있습니다.\rSkylake부터는 VGA 또한 별도의 GMBUS_PIN_VGADDC id 대신에 SDVO로 작동합니다.";
"TT_Pipe" = "Piker의 말로는 포트를 무리화하기 위해 사용되는 것으로 보이는데요, but I cannot find the usage.";
"TT_Type" = "유효한 타입:\r- 제로\r- 더미 (항상 더미로 사용되나 종종 VGA로 작동하는 것으로 보임)\r- LVDS (AMD LVDS에서와 같이 eDP에 사용됨)\r- DigitalDVI (eDP가 아닙니다)\r- SVID\r- VGA\r- DP\r- HDMI\r- AnalogDVI";
"TT_Flags" = "이들은 커넥터 플래그이며, Piker이 말한 것에 상관없이 이들은 지연할 게 없습니다.\rI tried to describe some in ConnectorFlags.";

// Connector Flags ToolTips
"TT_CNAlterAppertureRequirements" = "Lets apperture memory to be not required AppleIntelFramebuffer::isApertureMemoryRequired";
"TT_CNUnknownFlag_2" = "";
"TT_CNUnknownFlag_4" = "";
"TT_CNConnectorAlwaysConnected" = "Normally set for LVDS displays (i.e. built-in displays)";
"TT_CNUnknownFlag_10" = "";
"TT_CNUnknownFlag_20" = "";
"TT_CNDisableBlitTranslationTable" = "Disable blit translation table? AppleIntelFramebufferController::ConfigureBufferTranslation";
"TT_CNUseMiscIoPowerWell" = "Used in AppleIntelFramebufferController::setPowerWellState\rActivates MISC IO power well (SKL_DISP_PW_MISC_IO)";
"TT_CNUsePowerWell2" = "Used in AppleIntelFramebufferController::setPowerWellState\rActivates Power Well 2 usage (SKL_PW_CTL_IDX_PW_2)\rMay help with HDMI audio configuration issues\rREF: https://github.com/acidanthera/bugtracker/issues/1189";
"TT_CNUnknownFlag_200" = "";
"TT_CNUnknownFlag_400" = "";
"TT_CNUnknownFlag_800" = "";
"TT_CNUnknownFlag_1000" = "";
"TT_CNUnknownFlag_2000" = "";
"TT_CNUnknownFlag_4000" = "";
"TT_CNUnknownFlag_8000" = "";
"TT_CNUnknownZeroFlags" = "";

// Boot
"Bootloader" = "부트로더";
"Current Booted Version" = "현재 버전";
"Last Installed Version" = "이전 버전";
"Latest Available Version" = "최신 버전";
"Bootloader:" = "부트로더:";
"Auto Detect" = "자동 감지";
"Clover" = "클로버";
"OpenCore" = "오픈코어";
"Patches" = "패치";
"Select" = "선택";
"Comment" = "설명";
"Download Bootloader" = "부트로더 다운로드";
"Refresh Bootloader" = "새로고침";
"Apply Bootloader Patches" = "부트로더 패치 적용";

// NVRAM
"Variable Value" = "변수 값";
"Add" = "추가";
"Delete" = "삭제";
"Refresh" = "새로고침";

// Extensions
"Installed" = "설치 버전";
"Current" = "최신 버전";
"Download" = "다운로드";
"Replaced By" = "대체한 Kext";
"Description" = "설명";
"Url" = "URL";
"Show Installed Only" = "설치된 켁스트만 보기";
"Compile Output" = "컴파일 출력";
"Update Available" = "사용 가능한 업데이트";
"Update Version Info" = "새로고침";
"Download Selected" = "선택한 파일 다운로드";
"Compile Selected" = "선택한 파일 컴파일";

// Displays
"Vendor ID" = "벤더 ID";
"Product ID" = "제품 ID";
"Serial No." = "일련 번호";
"Scaled Resolutions" = "해상도";
"Width" = "가로 픽셀";
"Height" = "세로 픽셀";
"Inject EDID:" = "EDID 주입:";
"Fix Monitor Ranges" = "해상도 수정 추가";
"Patch Color Profile" = "컬러 프로파일 패치";
"Force RGB Mode" = "RGB 모드 강제";
"Inject Apple Info:" = "애플 정보 주입:";
"Icon:" = "아이콘:";
"Default" = "기본";
"Resolution:" = "해상도:";
"Manual" = "사용자 지정";
"Add Resolution" = "해상도 추가";
"Delete Resolution" = "해상도 삭제";

// Audio
"Pin Configuration" = "핀 구성";
"Audio Info" = "오디오 정보";
"Class" = "클래스";
"Sub Vendor" = "하위 벤더";
"Codec Vendor" = "코덱 벤더";
"Codec Name" = "코덱 이름";
"ALC Layout ID" = "ALC 레이아웃 ID";
"Revisions" = "버전";
"Min Kernel" = "최저 커널";
"Max Kernel" = "최대 커널";
"Codec ID" = "코덱 ID";
"Layout ID" = "레이아웃 ID";

// USB
"Series" = "시리즈";
"Device ID" = "기기 ID";
"USB Ports" = "USB 포트";
"Connector" = "커넥터 타입";
"Location ID" = "위치 ID";
"Port" = "포트";
"Dev Speed" = "기기 속도";
"Clear All" = "완전 삭제";
"Inject" = "주입";
"Active Port" = "활성화된 포트";

// Disks
"Partition Scheme" = "파티션 구성표";
"Volume Name" = "볼륨 이름";
"Mount Point" = "마운트 위치";
"Disk Type" = "디스크 타입";
"Mount" = "마운트";
"Unmount" = "마운트 해제";
"Open" = "열기";
"Boot EFI" = "EFI 위치";

// PCIe
"Debug" = "디버그";
"Subclass" = "하위 클래스";
"IOReg Name" = "IOReg 이름";
"IOReg IOName" = "IOReg IO 이름";
"Device Path" = "기기 경로";
"Update PCIIDs" = "PCIID 업데이트";

// Power
"Fix sleepimage" = "슬립이미지 고침";

// Calculator
"Sequence" = "수열";
"Hex:" = "16진수:";
"Hex (reversed):" = "16진수 (리버스):";
"Decimal:" = "10진수:";
"Octal:" = "8진수:";
"Binary:" = "2진수:";

// Tools
"Get AppleIntelInfo" = "AppleIntelInfo 실행";
"Install Kext for Atheros AR92xx/93xx WLan Cards (only 10.14+)" = "Atheros AR92xx/93xx Wi-Fi Kext 설치 (macOS Mojave 이상)";
"Select Destination" = "위치 선택";
"Install Kext to enable SATA HotPlug on Mojave" = "Mojave에서 SATA 핫플러그 활성화를 위한 Kext 설치";
"Generate Windows Bluetooth Registry File" = "윈도우용 블루투스 장치 인식 레지스트리 파일 생성";
"Generate Windows UTC Registry Files" = "윈도우용 UTC 설정 레지스트리 파일 생성";
"Disable Gatekeeper and mount the disk in read/write mode" = "Gatekeeper 비활성화 및 R/W 모드로 디스크 마운트";
"Disable Gatekeeper and mount the disk in read/write mode?" = "Gatekeeper를 비활성화하고 디스크를 R/W 모드로 마운트하시겠습니까?";
"This is required for some operations on macOS 10.15+" = "이 작업은 macOS 10.15 이상에서 몇몇 일들을 하기 위해 요구됩니다.";
"Dump ACPI" = "ACPI 덤프";
"Dump ACPI Tables" = "ACPI 테이블 덤프";
"Choose a destination folder" = "대상 폴더 선택";
"AppleIntelInfo Settings:" = "AppleIntelInfo 설정:";
"Log:" = "기록:";
"Enable HWP" = "HWP 활성화";
"Install Kext(s)" = "Kext 설치";
"Rebuild KextCache and Repair Permissions" = "Kext 캐시 리빌드 및 권한 복구";

// Log
"Log Options:" = "로그 옵션:";
"Last Boot" = "마지막 부팅";
"Erase Log" = "로그 삭제";
"Process:" = "프로세스:";
"Contains:" = "내용:";

// Bootloader Updater
"%@ Updated" = "%@ 업데이트됨";
"Downloading %@" = "%@ 다운로드 중";
"No new %@ Version is Avaliable at this Time!" = "지금은 새로운 %@ 버전을 사용할 수 없습니다!";
"%@ Version %@ is Available - you have %@. Would you like to download a newer Version?" = "%@ 버전 %@을 사용할 수 있습니다. (현재 %@ 버전) 새로운 버전을 다운로드하시겠습니까?";
"Update..." = "업데이트...";
"Set %@ Installer Location" = "%@ 설치 경로 설정";
"An error occured while trying to download %@ installer!" = "%@ 설치 프로그램을 다운로드하는 중 오류가 발생했습니다!";
"%1.1f Mbytes" = "%1.1f MBs";

// Misc
"You may require %@" = "%@가 필요할 수 있습니다";
"You may require Spoof Audio Device ID" = "오디오 기기 ID 교체가 필요할 수 있습니다";
"None" = "없음";
"Importing KextsToPatch" = "KextsToPatch 가져오기";
"%@ Patch" = "%@ Patch";
"Are you sure you want to apply %d %@ patch(s)?" = "%d 의 %@ 패치를 적용 하시겠습니까?";
"Patch Success!" = "패치 성공!";
"Patch Fail!" = "패치 실패!";
"Please select your existing config.plist to overwrite.\nData is written non-destructively and a backup will be created first." = "덮어 쓸 기존 config.plist를 선택하세요.\n데이터는 유해하지 않게끔 작성되며 백업 파일이 먼저 생성될 것입니다.";
"No Changes Detected!\r" = "변경 사항이 감지되지 않았습니다!\r";
"Unknown" = "알 수 없음";
"Mount Boot EFI Partition?" = "EFI 부트 파티션을 마운트 하시겠습니까?";
"Your Boot EFI Partition is not mounted." = "EFI 부트 파티션이 마운트되지 않았습니다.";
"Mount" = "마운트";
"Cancel" = "취소";
"Buy me a Beer" = "맥주 좀 사주세요";
"Installing '%@'...\n" = "'%@'를(을) 설치하고 있습니다...\n";
"Rebuilding KextCache and Repairing Permissions...\n" = "Kext 캐시 리빌드 및 권한 복구 중...\n";
"\"%@\" doesn't exist. Do you want to create it?" = "\"%@\"는(은) 존재하지 않습니다. 새로 만드시겠습니까?";
"\"%@\" does not exist. You can create a new one." = "\"%@\"는(은) 존재하지 않습니다. 새로 만들 수 있습니다.";
"Warning!" = "경고!";
"Enabling HWP (Intel Speed Shift) will require a reboot to restore the previous value." = "HWP (인텔 스피드 시프트)를 활성화하려면 이전 값을 복원하기 위해 재시동해야 합니다.";
"Logging Intel registers may cause your system to crash." = "인텔 레지스터를 기록하면 시스템이 다운될 수 있습니다.";
"Logging CStates" = "CStates 기록 중";
"Perform CPU intensive activity..." = "CPU에 집중적인 활동 수행 중...";
"Configuration Error" = "설정 오류";
"Unknown Status (%@)" = "알 수 없는 상태 (%@)";
"PCIIDs Update" = "PCIIDs 업데이트";
"Successful!" = "성공!";
"Failure!" = "실패!";
"Missing or incompatible nasm!" = "누락되었거나 호환되지 않는 nasm!";
"Click OK to run installation." = "OK를 클릭하여 설치합니다.";
"Snap"="스냅샷 만들기";
